conf/src/Documents/ЭП_АктПриемаПередачи/ЭП_АктПриемаПередачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_АктПриемаПередачи</name>
  <registerRecords>InformationRegister.ЭП_КачествоНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиПоОрганизацииРН</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСкладе</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСотрудниках</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ЭП_ВидыОперций</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ЭП_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_ВидНоменлкатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КачествоНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/InformationRegisters/ЭП_СтоимостьНоменклатуры/ЭП_СтоимостьНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_СтоимостьНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/ЭП_ВидыОперций/ЭП_ВидыОперций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ВидыОперций</name>
  <enumValues>
    <name>ПередачаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ПриемНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Documents/ЭП_АктПриемаПередачи/ManagerModule.bsl
#Область ОбработчикиСобытий

Функция ПечатьАктВыдачи(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_ЭП_АктВыдачи";
	Макет = Документы.ЭП_АктПриемаПередачи.ПолучитьМакет("ПФ_АктВыдачи");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_АктПриемаПередачи.Дата КАК ДатаДок,
	|	ЭП_АктПриемаПередачи.Сотрудник КАК ФИОПолучателя,
	|	ЭП_АктПриемаПередачи.Номер КАК Номер,
	|	ЭП_АктПриемаПередачи.Номенклатура.(
	|		Номенклатура КАК Оборудование
	|	) КАК Номенклатура,
	|	ЭП_АктПриемаПередачи.Склад.Город КАК Город,
	|	ЭП_АктПриемаПередачи.Организация КАК Организация
	|ИЗ
	|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
	|ГДЕ
	|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Заголовок.Параметры.Заполнить(ВыборкаДетальныеЗаписи);  
		ТабДок.Вывести(Заголовок, ВыборкаДетальныеЗаписи.Уровень()); 
		ВыборкаДетальныеЗаписиНоменклатура = ВыборкаДетальныеЗаписи.Номенклатура.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписиНоменклатура.Следующий() Цикл
			
			Строка.Параметры.Заполнить(ВыборкаДетальныеЗаписиНоменклатура);
			ТабДок.Вывести(Строка, ВыборкаДетальныеЗаписиНоменклатура.Уровень());
			
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(Подвал, ВыборкаДетальныеЗаписи.Уровень());
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции 

Функция ПечатьАктВозвратаФорма(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_ЭП_АктВозврата";
	Макет = Документы.ЭП_АктПриемаПередачи.ПолучитьМакет("ПФ_АктВозврата");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_АктПриемаПередачи.Дата КАК ДатаДок,
	|	ЭП_АктПриемаПередачи.Сотрудник КАК ФИОПолучателя,
	|	ЭП_АктПриемаПередачи.Номер КАК Номер,
	|	ЭП_АктПриемаПередачи.Номенклатура.(
	|		Номенклатура КАК Оборудование
	|	) КАК Номенклатура,
	|	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
	|	ЭП_АктПриемаПередачи.Склад.Город КАК Город,
	|	ЭП_АктПриемаПередачи.Организация КАК Организация
	|ИЗ
	|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
	|ГДЕ
	|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Заголовок.Параметры.Заполнить(ВыборкаДетальныеЗаписи);  
		ТабДок.Вывести(Заголовок, ВыборкаДетальныеЗаписи.Уровень()); 
		ВыборкаДетальныеЗаписиНоменклатура = ВыборкаДетальныеЗаписи.Номенклатура.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписиНоменклатура.Следующий() Цикл
			
			Строка.Параметры.Заполнить(ВыборкаДетальныеЗаписиНоменклатура);
			ТабДок.Вывести(Строка, ВыборкаДетальныеЗаписиНоменклатура.Уровень());
			
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(Подвал, ВыборкаДетальныеЗаписи.Уровень());
		
	КонецЦикла;
	
	Возврат ТабДок; 
	
КонецФункции 

Функция ПечатьТребование(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации
	|ИЗ
	|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
	|ГДЕ
	|	ЭП_АктПриемаПередачи.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВидОперации = Выборка.ВидОперации;
	КонецЦикла; 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_ЭП_Макет";
	Макет = Документы.ЭП_АктПриемаПередачи.ПолучитьМакет("ПФ_Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПечатьДокументаТребования(МассивОбъектов, ВидОперации);
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.УстановитьПараметр("Адрес", Справочники.ВидыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("НомерТелефона", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПечатьДокументаТребованияЦены(МассивОбъектов);
		
		Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
		
		ВыборкаНоменклатура = Запрос.Выполнить().Выбрать();
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ДетальнаяЗапись = Макет.ПолучитьОбласть("ДетальнаяЗапись");
		Подвал = Макет.ПолучитьОбласть("Подвал"); 
		
		Пока Выборка.Следующий() Цикл 
			
			НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
			
			Шапка.Параметры.Заполнить(Выборка);  
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			ТабДок.Вывести(ШапкаТаблицы, Выборка.Уровень());
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ДетальнаяЗапись.Параметры.Заполнить(ВыборкаНоменклатура);
				ТабДок.Вывести(ДетальнаяЗапись, ВыборкаНоменклатура.Уровень()); 
				
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал, Выборка.Уровень());
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
			
		КонецЦикла; 
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПечатьДокументаТребованияБезАдресаИТелефона(МассивОбъектов, ВидОперации); 
		Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
		
		РезультатЗапроса = Запрос.Выполнить();	
		Выборка = РезультатЗапроса.Выбрать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПечатьДокументаТребованияЦены(МассивОбъектов);	
		Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);	
		ВыборкаНоменклатура = Запрос.Выполнить().Выбрать();
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ДетальнаяЗапись = Макет.ПолучитьОбласть("ДетальнаяЗапись");
		Подвал = Макет.ПолучитьОбласть("Подвал"); 
		
		Пока Выборка.Следующий() Цикл 
			
			НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
			
			Шапка.Параметры.Заполнить(Выборка);  
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			ТабДок.Вывести(ШапкаТаблицы, Выборка.Уровень());
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ДетальнаяЗапись.Параметры.Заполнить(ВыборкаНоменклатура);
				ТабДок.Вывести(ДетальнаяЗапись, ВыборкаНоменклатура.Уровень()); 
				
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал, Выборка.Уровень());
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
			
		КонецЦикла; 
		
	КонецЕсли;
		
Возврат ТабДок;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПечатьДокументаТребования(МассивОбъектов, ВидОперации)
	
	Если ВидОперации = Перечисления.ЭП_ВидыОперций.ПередачаНоменклатуры Тогда
		
		Возврат "ВЫБРАТЬ
		        |	ЭП_АктПриемаПередачи.Сотрудник КАК ФизЛицоПолучатель,
		        |	ЭП_АктПриемаПередачи.Организация КАК Организация,
		        |	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации,
		        |	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
		        |	ЭП_АктПриемаПередачи.Ссылка КАК Ссылка,
		        |	ЭП_АктПриемаПередачи.Номер КАК Номер,
		        |	ЭП_АктПриемаПередачи.Дата КАК Дата
		        |ПОМЕСТИТЬ ВТДанныеДокумента
		        |ИЗ
		        |	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
		        |ГДЕ
		        |	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТДанныеДокумента.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		        |	ВТДанныеДокумента.ВидОперации КАК ВидОперации,
		        |	ВТДанныеДокумента.Организация КАК Организация,
		        |	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		        |	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		        |	ЭП_Организации.ИНН КАК ИНН,
		        |	ЭП_Организации.РасчетныйСчет КАК РасчетныйСчет,
		        |	ЭП_Организации.БИК КАК БИК,
		        |	ЭП_Организации.КорреспондентскийСчет КАК КорреспондентскийСчет,
		        |	ЭП_Организации.Банк КАК Банк,
		        |	Пользователи.ЭП_Сотрудник КАК ФизЛицоОтправитель,
		        |	ВТДанныеДокумента.Ссылка КАК Ссылка,
		        |	ВТДанныеДокумента.Номер КАК Номер,
		        |	ВТДанныеДокумента.Дата КАК Дата
		        |ПОМЕСТИТЬ ВТДанныеОргИСотр
		        |ИЗ
		        |	ВТДанныеДокумента КАК ВТДанныеДокумента
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		        |		ПО ВТДанныеДокумента.ФизЛицоПолучатель = ЭП_Сотрудники.Ссылка
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации КАК ЭП_Организации
		        |		ПО ВТДанныеДокумента.Организация = ЭП_Организации.Ссылка
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		        |		ПО ВТДанныеДокумента.Отвественный = Пользователи.Ссылка
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТДанныеОргИСотр.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		        |	ВТДанныеОргИСотр.ВидОперации КАК ВидОперации,
		        |	ВТДанныеОргИСотр.Организация КАК Организация,
		        |	ВТДанныеОргИСотр.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		        |	ВТДанныеОргИСотр.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		        |	ВТДанныеОргИСотр.ИНН КАК ИНН,
		        |	ВТДанныеОргИСотр.РасчетныйСчет КАК РасчетныйСчет,
		        |	ВТДанныеОргИСотр.БИК КАК БИК,
		        |	ВТДанныеОргИСотр.КорреспондентскийСчет КАК КорреспондентскийСчет,
		        |	ВТДанныеОргИСотр.Банк КАК Банк,
		        |	ВТДанныеОргИСотр.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		        |	ЭП_Сотрудники.Должность КАК ФизЛицоОтправительДолжность,
		        |	ЭП_Сотрудники.Подразделение КАК РабочееМестоОтправитель,
		        |	ВТДанныеОргИСотр.Ссылка КАК Ссылка,
		        |	ВТДанныеОргИСотр.Номер КАК Номер,
		        |	ВТДанныеОргИСотр.Дата КАК Дата
		        |ПОМЕСТИТЬ ВТДанныеСОтв
		        |ИЗ
		        |	ВТДанныеОргИСотр КАК ВТДанныеОргИСотр
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		        |		ПО ВТДанныеОргИСотр.ФизЛицоОтправитель = ЭП_Сотрудники.Ссылка
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТДанныеСОтв.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		        |	ВТДанныеСОтв.ВидОперации КАК ВидОперации,
		        |	ВТДанныеСОтв.Организация КАК Организация,
		        |	ВТДанныеСОтв.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		        |	ВТДанныеСОтв.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		        |	ВТДанныеСОтв.ИНН КАК ИНН,
		        |	ВТДанныеСОтв.РасчетныйСчет КАК РасчетныйСчет,
		        |	ВТДанныеСОтв.БИК КАК БИК,
		        |	ВТДанныеСОтв.КорреспондентскийСчет КАК КорреспондентскийСчет,
		        |	ВТДанныеСОтв.Банк КАК Банк,
		        |	ВТДанныеСОтв.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		        |	ВТДанныеСОтв.ФизЛицоОтправительДолжность КАК ФизЛицоОтправительДолжность,
		        |	ВТДанныеСОтв.РабочееМестоОтправитель КАК РабочееМестоОтправитель,
		        |	ЭП_ОрганизацииКонтактнаяИнформация.Представление КАК Адрес,
		        |	ВТДанныеСОтв.Ссылка КАК Ссылка,
		        |	ВТДанныеСОтв.Номер КАК Номер,
		        |	ВТДанныеСОтв.Дата КАК Дата
		        |ПОМЕСТИТЬ ВТДанныеСАдресом
		        |ИЗ
		        |	ВТДанныеСОтв КАК ВТДанныеСОтв
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации.КонтактнаяИнформация КАК ЭП_ОрганизацииКонтактнаяИнформация
		        |		ПО ВТДанныеСОтв.Организация = ЭП_ОрганизацииКонтактнаяИнформация.Ссылка
		        |ГДЕ
		        |	ЭП_ОрганизацииКонтактнаяИнформация.Вид = &Адрес
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТДанныеСАдресом.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		        |	ВТДанныеСАдресом.ВидОперации КАК ВидОперации,
		        |	ВТДанныеСАдресом.Организация КАК Организация,
		        |	ВТДанныеСАдресом.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		        |	ВТДанныеСАдресом.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		        |	ВТДанныеСАдресом.ИНН КАК ИНН,
		        |	ВТДанныеСАдресом.РасчетныйСчет КАК РасчетныйСчет,
		        |	ВТДанныеСАдресом.БИК КАК Бик,
		        |	ВТДанныеСАдресом.КорреспондентскийСчет КАК Кс,
		        |	ВТДанныеСАдресом.Банк КАК Банк,
		        |	ВТДанныеСАдресом.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		        |	ВТДанныеСАдресом.ФизЛицоОтправительДолжность КАК ФизЛицоОтправительДолжность,
		        |	ВТДанныеСАдресом.РабочееМестоОтправитель КАК РабочееМестоОтправитель,
		        |	ВТДанныеСАдресом.Адрес КАК Адрес,
		        |	ЭП_ОрганизацииКонтактнаяИнформация.НомерТелефона КАК Телефон,
		        |	ВТДанныеСАдресом.Ссылка КАК Ссылка,
		        |	ВТДанныеСАдресом.Номер КАК Номер,
		        |	ВТДанныеСАдресом.Дата КАК Дата
		        |ИЗ
		        |	ВТДанныеСАдресом КАК ВТДанныеСАдресом
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации.КонтактнаяИнформация КАК ЭП_ОрганизацииКонтактнаяИнформация
		        |		ПО ВТДанныеСАдресом.Организация = ЭП_ОрганизацииКонтактнаяИнформация.Ссылка
		        |ГДЕ
		        |	ЭП_ОрганизацииКонтактнаяИнформация.Вид = &НомерТелефона";
		
	Иначе 
		
		Возврат "ВЫБРАТЬ
		|	ЭП_АктПриемаПередачи.Сотрудник КАК ФизЛицоПолучатель,
		|	ЭП_АктПриемаПередачи.Организация КАК Организация,
		|	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации,
		|	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
		|	ЭП_АктПриемаПередачи.Ссылка КАК Ссылка,
		|	ЭП_АктПриемаПередачи.Номер КАК Номер,
		|	ЭП_АктПриемаПередачи.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
		|ГДЕ
		|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеДокумента.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеДокумента.ВидОперации КАК ВидОперации,
		|	ВТДанныеДокумента.Организация КАК Организация,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		|	ЭП_Организации.ИНН КАК ИНН,
		|	ЭП_Организации.РасчетныйСчет КАК РасчетныйСчет,
		|	ЭП_Организации.БИК КАК БИК,
		|	ЭП_Организации.КорреспондентскийСчет КАК КорреспондентскийСчет,
		|	ЭП_Организации.Банк КАК Банк,
		|	Пользователи.ЭП_Сотрудник КАК ФизЛицоОтправитель,
		|	ВТДанныеДокумента.Ссылка КАК Ссылка,
		|	ВТДанныеДокумента.Номер КАК Номер,
		|	ВТДанныеДокумента.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеОргИСотр
		|ИЗ
		|	ВТДанныеДокумента КАК ВТДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеДокумента.ФизЛицоПолучатель = ЭП_Сотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации КАК ЭП_Организации
		|		ПО ВТДанныеДокумента.Организация = ЭП_Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВТДанныеДокумента.Отвественный = Пользователи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеОргИСотр.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеОргИСотр.ВидОперации КАК ВидОперации,
		|	ВТДанныеОргИСотр.Организация КАК Организация,
		|	ВТДанныеОргИСотр.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		|	ВТДанныеОргИСотр.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		|	ВТДанныеОргИСотр.ИНН КАК ИНН,
		|	ВТДанныеОргИСотр.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеОргИСотр.БИК КАК БИК,
		|	ВТДанныеОргИСотр.КорреспондентскийСчет КАК КорреспондентскийСчет,
		|	ВТДанныеОргИСотр.Банк КАК Банк,
		|	ВТДанныеОргИСотр.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоОтправительДолжность,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоОтправитель,
		|	ВТДанныеОргИСотр.Ссылка КАК Ссылка,
		|	ВТДанныеОргИСотр.Номер КАК Номер,
		|	ВТДанныеОргИСотр.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеСОтв
		|ИЗ
		|	ВТДанныеОргИСотр КАК ВТДанныеОргИСотр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеОргИСотр.ФизЛицоОтправитель = ЭП_Сотрудники.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеСОтв.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеСОтв.ВидОперации КАК ВидОперации,
		|	ВТДанныеСОтв.Организация КАК Организация,
		|	ВТДанныеСОтв.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		|	ВТДанныеСОтв.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		|	ВТДанныеСОтв.ИНН КАК ИНН,
		|	ВТДанныеСОтв.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеСОтв.БИК КАК БИК,
		|	ВТДанныеСОтв.КорреспондентскийСчет КАК КорреспондентскийСчет,
		|	ВТДанныеСОтв.Банк КАК Банк,
		|	ВТДанныеСОтв.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		|	ВТДанныеСОтв.ФизЛицоОтправительДолжность КАК ФизЛицоОтправительДолжность,
		|	ВТДанныеСОтв.РабочееМестоОтправитель КАК РабочееМестоОтправитель,
		|	ЭП_ОрганизацииКонтактнаяИнформация.Представление КАК Адрес,
		|	ВТДанныеСОтв.Ссылка КАК Ссылка,
		|	ВТДанныеСОтв.Номер КАК Номер,
		|	ВТДанныеСОтв.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеСАдресом
		|ИЗ
		|	ВТДанныеСОтв КАК ВТДанныеСОтв
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации.КонтактнаяИнформация КАК ЭП_ОрганизацииКонтактнаяИнформация
		|		ПО ВТДанныеСОтв.Организация = ЭП_ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ЭП_ОрганизацииКонтактнаяИнформация.Вид = &Адрес
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеСАдресом.ФизЛицоПолучатель КАК ФизЛицоОтправитель,
		|	ВТДанныеСАдресом.ВидОперации КАК ВидОперации,
		|	ВТДанныеСАдресом.Организация КАК Организация,
		|	ВТДанныеСАдресом.РабочееМестоПолучатель КАК РабочееМестоОтправитель,
		|	ВТДанныеСАдресом.ФизЛицоПолучательДолжность КАК ФизЛицоОтправительДолжность,
		|	ВТДанныеСАдресом.ИНН КАК ИНН,
		|	ВТДанныеСАдресом.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеСАдресом.БИК КАК Бик,
		|	ВТДанныеСАдресом.КорреспондентскийСчет КАК Кс,
		|	ВТДанныеСАдресом.Банк КАК Банк,
		|	ВТДанныеСАдресом.ФизЛицоОтправитель КАК ФизЛицоПолучатель,
		|	ВТДанныеСАдресом.ФизЛицоОтправительДолжность КАК ФизЛицоПолучательДолжность,
		|	ВТДанныеСАдресом.РабочееМестоОтправитель КАК РабочееМестоПолучатель,
		|	ВТДанныеСАдресом.Адрес КАК Адрес,
		|	ЭП_ОрганизацииКонтактнаяИнформация.НомерТелефона КАК Телефон,
		|	ВТДанныеСАдресом.Ссылка КАК Ссылка,
		|	ВТДанныеСАдресом.Номер КАК Номер,
		|	ВТДанныеСАдресом.Дата КАК Дата
		|ИЗ
		|	ВТДанныеСАдресом КАК ВТДанныеСАдресом
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации.КонтактнаяИнформация КАК ЭП_ОрганизацииКонтактнаяИнформация
		|		ПО ВТДанныеСАдресом.Организация = ЭП_ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ЭП_ОрганизацииКонтактнаяИнформация.Вид = &НомерТелефона";
		
	КонецЕсли;
	
КонецФункции
	
Функция ТекстЗапросаПечатьДокументаТребованияЦены(МассивОбъектов)
	
	Возврат "ВЫБРАТЬ
	|	ЭП_АктПриемаПередачиНоменклатура.Номенклатура КАК Номенклатура,
	|	ЭП_АктПриемаПередачиНоменклатура.ИнвентарныйНомер КАК СерийныйНомер,
	|	ЭП_АктПриемаПередачиНоменклатура.ВидНоменклатуры КАК Модель,
	|	ЭП_СтоимостьНоменклатурыСрезПоследних.Стоимость КАК Цена
	|ИЗ
	|	Документ.ЭП_АктПриемаПередачи.Номенклатура КАК ЭП_АктПриемаПередачиНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_СтоимостьНоменклатуры.СрезПоследних КАК ЭП_СтоимостьНоменклатурыСрезПоследних
	|		ПО ЭП_АктПриемаПередачиНоменклатура.Номенклатура = ЭП_СтоимостьНоменклатурыСрезПоследних.Номенклатура
	|			И ЭП_АктПриемаПередачиНоменклатура.ИнвентарныйНомер = ЭП_СтоимостьНоменклатурыСрезПоследних.ИнвентарныйНомер
	|ГДЕ
	|	ЭП_АктПриемаПередачиНоменклатура.Ссылка В(&Ссылка)"
		
КонецФункции
	
Функция ТекстЗапросаПечатьДокументаТребованияБезАдресаИТелефона(МассивОбъектов, ВидОперации)
	
	Если ВидОперации = Перечисления.ЭП_ВидыОперций.ПередачаНоменклатуры Тогда
		
		Возврат "ВЫБРАТЬ
		|	ЭП_АктПриемаПередачи.Сотрудник КАК ФизЛицоПолучатель,
		|	ЭП_АктПриемаПередачи.Организация КАК Организация,
		|	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации,
		|	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
		|	ЭП_АктПриемаПередачи.Ссылка КАК Ссылка,
		|	ЭП_АктПриемаПередачи.Номер КАК Номер,
		|	ЭП_АктПриемаПередачи.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
		|ГДЕ
		|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеДокумента.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеДокумента.ВидОперации КАК ВидОперации,
		|	ВТДанныеДокумента.Организация КАК Организация,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		|	ЭП_Организации.ИНН КАК ИНН,
		|	ЭП_Организации.РасчетныйСчет КАК РасчетныйСчет,
		|	ЭП_Организации.БИК КАК БИК,
		|	ЭП_Организации.КорреспондентскийСчет КАК КорреспондентскийСчет,
		|	ЭП_Организации.Банк КАК Банк,
		|	Пользователи.ЭП_Сотрудник КАК ФизЛицоОтправитель,
		|	ВТДанныеДокумента.Ссылка КАК Ссылка,
		|	ВТДанныеДокумента.Номер КАК Номер,
		|	ВТДанныеДокумента.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеОргИСотр
		|ИЗ
		|	ВТДанныеДокумента КАК ВТДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеДокумента.ФизЛицоПолучатель = ЭП_Сотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации КАК ЭП_Организации
		|		ПО ВТДанныеДокумента.Организация = ЭП_Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВТДанныеДокумента.Отвественный = Пользователи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеОргИСотр.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеОргИСотр.ВидОперации КАК ВидОперации,
		|	ВТДанныеОргИСотр.Организация КАК Организация,
		|	ВТДанныеОргИСотр.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		|	ВТДанныеОргИСотр.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		|	ВТДанныеОргИСотр.ИНН КАК ИНН,
		|	ВТДанныеОргИСотр.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеОргИСотр.БИК КАК Бик,
		|	ВТДанныеОргИСотр.КорреспондентскийСчет КАК Кс,
		|	ВТДанныеОргИСотр.Банк КАК Банк,
		|	ВТДанныеОргИСотр.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоОтправительДолжность,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоОтправитель,
		|	ВТДанныеОргИСотр.Ссылка КАК Ссылка,
		|	ВТДанныеОргИСотр.Номер КАК Номер,
		|	ВТДанныеОргИСотр.Дата КАК Дата
		|ИЗ
		|	ВТДанныеОргИСотр КАК ВТДанныеОргИСотр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеОргИСотр.ФизЛицоОтправитель = ЭП_Сотрудники.Ссылка";
		
	Иначе 
		
		Возврат "ВЫБРАТЬ
		|	ЭП_АктПриемаПередачи.Сотрудник КАК ФизЛицоПолучатель,
		|	ЭП_АктПриемаПередачи.Организация КАК Организация,
		|	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации,
		|	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
		|	ЭП_АктПриемаПередачи.Ссылка КАК Ссылка,
		|	ЭП_АктПриемаПередачи.Номер КАК Номер,
		|	ЭП_АктПриемаПередачи.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
		|ГДЕ
		|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеДокумента.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеДокумента.ВидОперации КАК ВидОперации,
		|	ВТДанныеДокумента.Организация КАК Организация,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		|	ЭП_Организации.ИНН КАК ИНН,
		|	ЭП_Организации.РасчетныйСчет КАК РасчетныйСчет,
		|	ЭП_Организации.БИК КАК Бик,
		|	ЭП_Организации.КорреспондентскийСчет КАК Кс,
		|	ЭП_Организации.Банк КАК Банк,
		|	Пользователи.ЭП_Сотрудник КАК ФизЛицоОтправитель,
		|	ВТДанныеДокумента.Ссылка КАК Ссылка,
		|	ВТДанныеДокумента.Номер КАК Номер,
		|	ВТДанныеДокумента.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеОргИСотр
		|ИЗ
		|	ВТДанныеДокумента КАК ВТДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеДокумента.ФизЛицоПолучатель = ЭП_Сотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации КАК ЭП_Организации
		|		ПО ВТДанныеДокумента.Организация = ЭП_Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВТДанныеДокумента.Отвественный = Пользователи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеОргИСотр.ФизЛицоПолучатель КАК ФизЛицоОтправитель,
		|	ВТДанныеОргИСотр.ВидОперации КАК ВидОперации,
		|	ВТДанныеОргИСотр.Организация КАК Организация,
		|	ВТДанныеОргИСотр.РабочееМестоПолучатель КАК РабочееМестоОтправитель,
		|	ВТДанныеОргИСотр.ФизЛицоПолучательДолжность КАК ФизЛицоОтправительДолжность,
		|	ВТДанныеОргИСотр.ИНН КАК ИНН,
		|	ВТДанныеОргИСотр.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеОргИСотр.БИК КАК Бик,
		|	ВТДанныеОргИСотр.КорреспондентскийСчет КАК Кс,
		|	ВТДанныеОргИСотр.Банк КАК Банк,
		|	ВТДанныеОргИСотр.ФизЛицоОтправитель КАК ФизЛицоПолучатель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		|	ВТДанныеОргИСотр.Ссылка КАК Ссылка,
		|	ВТДанныеОргИСотр.Номер КАК Номер,
		|	ВТДанныеОргИСотр.Дата КАК Дата
		|ИЗ
		|	ВТДанныеОргИСотр КАК ВТДанныеОргИСотр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеОргИСотр.ФизЛицоОтправитель = ЭП_Сотрудники.Ссылка";
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_АктВыдачи";
	КомандаПечати.Представление = НСтр("ru = 'Акт выдачи'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_АктВозврата";
	КомандаПечати.Представление = НСтр("ru = 'Акт возврата'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_Макет";
	КомандаПечати.Представление = НСтр("ru = 'Требование'");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_АктВыдачи") Тогда
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_АктВыдачи"); 
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАктВыдачи(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт выдачи'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЭП_АктПриемаПередачи.ПФ_АктВыдачи";   
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_АктВозврата") Тогда 	
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_АктВозврата");		
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАктВозвратаФорма(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'АктВозврата'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЭП_АктПриемаПередачи.ПФ_АктВозврата"; 
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_Макет") Тогда 
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_Макет");
		ПечатнаяФорма.ТабличныйДокумент = ПечатьТребование(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Требование'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЭП_АктПриемаПередачи.ПФ_Требование";		
	КонецЕсли;
			
КонецПроцедуры      
	
#КонецОбласти
